# Основы pandas

In [1]:
import pandas as pd

Пример забора данных с сайтов

In [5]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют на 18.04.2020 на 21.04.2020
0  Доллар США      73,9441₽      74,6657₽
1        Евро      80,1110₽      81,1019₽

In [ ]:
pd.read_html('http://www.cbr.ru')[2]

In [6]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [ ]:
pd.read_sql('select * from table;', connection)

In [8]:
df[0]

       Дата  Закрытие  Открытие  Максимум  Минимум
0  19.04.20    740060    740650    740650   738240
1  18.04.20    740750    740750    740750   740750
2  17.04.20    740745    738110    744370   730810
3  16.04.20    738160    749395    750500   737415
4  15.04.20    749410    730495    753470   728520
5  14.04.20    730230    736382    736395   727310
6  13.04.20    736381    734500    737930   728745
7  12.04.20    735935    738015    738015   734745
8  10.04.20    735485    742917    744145   731530

Импорт данных из файла

In [11]:
data = pd.read_csv('power.csv', sep=',')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [14]:
data.tail(3)

          country  year  quantity  category
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [15]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [16]:
# количество строк в датафрейме

len(data)

1189482

In [17]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [18]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [19]:
data = pd.read_csv('transactions.csv')
len(data)

60

In [24]:
df = pd.read_csv('transactions.csv')
print(df.head())
df.shape

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

(60, 8)

In [21]:
data1 = pd.read_csv('transactions.csv')
data1.shape

(60, 8)

In [22]:
transact_data = pd.read_csv('transactions.csv')
transact_data.shape

(60, 8)

In [25]:
df.to_excel('result.csv')

In [33]:
?df.to_excel

### Основные сведения о датафрейме

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
country          1189482 non-null object
year             1189482 non-null int64
quantity         1189482 non-null float64
category         1189482 non-null int64
year_plus_one    1189482 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [34]:
# немного статистики

data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

In [ ]:
1.842648e+05

In [35]:
1.842648 * 10**5

184264.80000000002

### Отдельный столбец (тип Series)

In [43]:
data['year']

0          1996
1          1995
2          2014
3          2013
4          2012
           ...
1189477    2012
1189478    2011
1189479    2010
1189480    2009
1189481    2008
Name: year, Length: 1189482, dtype: int64

In [41]:
# или так

data.year

0          1996
1          1995
2          2014
3          2013
4          2012
           ...
1189477    2012
1189478    2011
1189479    2010
1189480    2009
1189481    2008
Name: year, Length: 1189482, dtype: int64

In [ ]:
data['year plus one']

In [ ]:
YearPlusOne

In [38]:
type(data['year'])

pandas.core.series.Series

In [ ]:
data.head()

In [44]:
set([1, 1, 2, 1])

{1, 2}

In [46]:
# уникальные значения в столбце

len(data['category'].unique())

71

In [ ]:
len(data['category'].unique())

In [47]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [48]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [49]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [50]:
new_data = pd.read_csv('transactions.csv')
new_data['Product'].value_counts(normalize=True)

_5    0.183333
_8    0.133333
_2    0.133333
_3    0.116667
_4    0.116667
A5    0.083333
A4    0.083333
A1    0.083333
A2    0.033333
_6    0.033333
Name: Product, dtype: float64

In [51]:
data = pd.read_csv('transactions.csv')
data.head()
data['Product'].value_counts().head(1)

_5    11
Name: Product, dtype: int64

# Фильтры

In [52]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [53]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [ ]:
data[['country', '']]

In [54]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [55]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [56]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [57]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [ ]:
if () & ():

In [ ]:
# самый популярный способ

data[ data.quantity > average_level ].head()

### Как определить используемый вариант названия страны?

In [58]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [62]:
if 'rus' in 'Russia Federation':
    print('Нашли')

In [ ]:
str.replace

In [63]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [ ]:
if (a > 1) and (b < 3):

In [67]:
2 + 2 * 2

6

In [ ]:
(() | ()) | (() & ())

In [64]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [69]:
data[data.country.isin(['Russian Federation', 'Belarus'])]

                    country  year  quantity  category
6940     Russian Federation  2014   12714.0         3
6941     Russian Federation  2013   11285.0         3
6942     Russian Federation  2012   11302.0         3
6943     Russian Federation  2011    7611.0         3
6944     Russian Federation  2010    9263.0         3
...                     ...   ...       ...       ...
1189189  Russian Federation  2001       3.0        71
1189190  Russian Federation  2000       2.0        71
1189191  Russian Federation  1999       2.0        71
1189192  Russian Federation  1998       0.0        71
1189193  Russian Federation  1997       0.0        71

[23697 rows x 4 columns]

In [68]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [71]:
list(range(0, 5))

[0, 1, 2, 3, 4]

In [70]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [72]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [73]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [74]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [77]:
# сортировка по нескольким столбцам

data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False]).head(50)

             country  year     quantity  category
835137   Afghanistan  1990  3902100.000        42
492297   Afghanistan  1990   512000.000        31
491412   Afghanistan  1990   400000.000        31
492006   Afghanistan  1990   112000.000        31
491548   Afghanistan  1990    66000.000        31
820588   Afghanistan  1990     8897.000        42
791325   Afghanistan  1990     8167.000        42
797903   Afghanistan  1990     8167.000        42
811517   Afghanistan  1990     8167.000        42
813907   Afghanistan  1990     8167.000        42
828414   Afghanistan  1990     8167.000        42
832417   Afghanistan  1990     8167.000        42
1102827  Afghanistan  1990     1128.000        67
1097295  Afghanistan  1990     1055.000        67
1116195  Afghanistan  1990     1055.000        67
1137192  Afghanistan  1990      814.000        67
563395   Afghanistan  1990      764.000        33
1161814  Afghanistan  1990      740.000        67
364504   Afghanistan  1990      691.216        25
369529   Afghanistan  1990      691.216        25
816725   Afghanistan  1990      535.000        42
245778   Afghanistan  1990      494.000        21
334690   Afghanistan  1990      457.252        25
341806   Afghanistan  1990      457.252        25
353129   Afghanistan  1990      457.252        25
357865   Afghanistan  1990      457.252        25
240257   Afghanistan  1990      425.000        21
1061045  Afghanistan  1990      404.000        67
1091796  Afghanistan  1990      404.000        67
1032130  Afghanistan  1990      364.000        65
442811   Afghanistan  1990      330.000        27
462561   Afghanistan  1990      330.000        27
1133516  Afghanistan  1990      314.000        67
236467   Afghanistan  1990      292.000        21
1143336  Afghanistan  1990      290.000        67
213707   Afghanistan  1990      285.000        21
1045346  Afghanistan  1990      282.000        67
407587   Afghanistan  1990      280.000        27
419807   Afghanistan  1990      280.000        27
432330   Afghanistan  1990      280.000        27
437571   Afghanistan  1990      280.000        27
374439   Afghanistan  1990      233.964        25
378300   Afghanistan  1990      233.964        25
230455   Afghanistan  1990      202.000        21
810772   Afghanistan  1990      195.000        42
1111027  Afghanistan  1990      158.000        67
588275   Afghanistan  1990      143.000        35
207726   Afghanistan  1990      140.000        21
575808   Afghanistan  1990      126.000        35
578786   Afghanistan  1990      126.000        35

### Параметр inplace

In [90]:
data.head()

         country  year  quantity  category
900985  Zimbabwe  2008       1.0        51
506011  Zimbabwe  1992     132.0        31
506000  Zimbabwe  2003      13.0        31
506311  Zimbabwe  2013      30.0        31
506310  Zimbabwe  2014      31.0        31

In [89]:
data.sort_values('country', ascending=False, inplace=True)

In [ ]:
if rewrite == True:
    data = data.sort_values('country', ascending=True)
else:
    data.sort_values('country', ascending=True)

In [ ]:
data.sort_values('country', ascending=True, inplace=rewrite)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?